src/Reports/гф_СтатусыGTINвПТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Report>
		<Properties>
			<Name>гф_СтатусыGTINвПТУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСтатусов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоСтатусам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДоступныхПоступлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Documents/ПриобретениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПриобретениеТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>гф_ПродукцияВКоробах</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Reports/гф_СтатусыGTINвПТУ/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокСтатусовПриИзменении(Элемент)
	
	Если Отчет.СписокСтатусов.Количество() > 0 Тогда 
		ОтборПоСтатусам = Истина;
	иначе
		ОтборПоСтатусам = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступныеТипы = Новый ОписаниеТипов("ПеречислениеСсылка.гф_СтатусыGTIN_В_НК");
	Отчет.СписокСтатусов.ТипЗначения = ДоступныеТипы;
	
	ДоступныеТипыВида = Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры");
	Отчет.ВидНоменклатуры.ТипЗначения = ДоступныеТипыВида;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТЧСписокДоступныхПоступлений()
	
	Если Отчет.ВидНоменклатуры.Количество() = 0 Тогда
		СписокВидов = Новый Массив;
		СписокВидов.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Обувь"));
	Иначе 
		СписокВидов = Отчет.ВидНоменклатуры.ВыгрузитьЗначения();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка,
		|	ПриобретениеТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
		|ГДЕ
		|	ПриобретениеТоваровУслугТовары.Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)
		|	И ПриобретениеТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ПриобретениеТоваровУслугТовары.Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", СписокВидов); 
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.ПериодОтчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.ПериодОтчета.ДатаОкончания); 
	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		 Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Иначе
		 Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПриобретениеТоваровУслугТовары.Ссылка.Организация = &Организация", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Отчет.СписокДоступныхПоступлений.Очистить();
	Пока Выборка.Следующий() Цикл
		  НоваяСтрока = Отчет.СписокДоступныхПоступлений.Добавить();
		  НоваяСтрока.Контрагент = Выборка.Контрагент;
		  НоваяСтрока.СсылкаНаДокумент = Выборка.Ссылка;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.ПериодОтчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Период");
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьТЧСписокДоступныхПоступлений();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМетки(Команда)  
		
	Если Команда = ЭтотОбъект.Команды.ОтметитьВсе Тогда
		
		Флаг = Истина;
		
	ИначеЕсли Команда = ЭтотОбъект.Команды.СнятьВсеОтметки Тогда
		
		Флаг = Ложь;
		
	Иначе       
		
		Возврат;
		
	КонецЕсли;			
	
	Для Каждого СтрокаТаблицы Из Отчет.СписокДоступныхПоступлений Цикл
		
		СтрокаТаблицы.Использовать = Флаг;
		
	КонецЦикла;	
	
КонецПроцедуры
